05_HackersNights.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-11-26 mar. 17:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Project: Interactive Data Analysis</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Project: Interactive Data Analysis</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfb7b8aa">1. Finding the dataset</a></li>
<li><a href="#orgc966c1a">2. Basic analysis of the dataset</a></li>
<li><a href="#orgfd5e29b">3. Advanced analysis of the dataset</a></li>
<li><a href="#org218c7d4">4. Presenting to your peers</a></li>
</ul>
</div>
</div>
<p>
You have less than 12 hours to:
</p>
<ul class="org-ul">
<li>find a dataset</li>
<li>create an interactive analysis or experience with it</li>
<li>present it to your peers</li>
</ul>

<div id="outline-container-orgfb7b8aa" class="outline-2">
<h2 id="orgfb7b8aa"><span class="section-number-2">1</span> Finding the dataset</h2>
<div class="outline-text-2" id="text-1">
<p>
You need to find a dataset that is:
</p>
<ul class="org-ul">
<li>tidy (unless you want to waste precious time tidying it)</li>
<li>interesting (at least to you)</li>
<li>in a format that you will be able to load into pandas</li>
</ul>


<p>
If you want to find a dataset about X, you should google keywords like:
</p>
<ul class="org-ul">
<li>X dataset</li>
<li>X datadump</li>
<li>X database</li>
<li>X open data</li>
<li>X csv data</li>
<li>X machine learning training</li>
</ul>


<p>
You can also visit the following websites to find some examples of what I'm talking about:
</p>
<ul class="org-ul">
<li><a href="https://www.imdb.com/interfaces/">https://www.imdb.com/interfaces/</a></li>
<li><a href="https://research.spotify.com/datasets">https://research.spotify.com/datasets</a></li>
<li><a href="https://web.archive.org/web/20090925184737/http://archive.ics.uci.edu/ml/datasets/Netflix+Prize">https://web.archive.org/web/20090925184737/http://archive.ics.uci.edu/ml/datasets/Netflix+Prize</a></li>
<li><a href="https://www.kaggle.com/datasets">https://www.kaggle.com/datasets</a></li>
<li><a href="https://www.data.gouv.fr/fr/">https://www.data.gouv.fr/fr/</a></li>
</ul>


<p>
Your choice of a dataset will be instrumental in your failure or your success, but you need to spend more time analysing the data than finding it, so proceed with both haste and caution.
</p>

<p>
If you are unsure, please come and see me to see what advice I have to give about your choice of a dataset.
</p>
</div>
</div>
<div id="outline-container-orgc966c1a" class="outline-2">
<h2 id="orgc966c1a"><span class="section-number-2">2</span> Basic analysis of the dataset</h2>
<div class="outline-text-2" id="text-2">
<p>
You will get a B if you can reproduce what we did with the titanic data and the crime data, namely:
</p>
<ul class="org-ul">
<li>load the dataset in a notebook using pandas</li>
<li>Make sure it is tidy, or tidy it up yourself</li>
<li>Using convincing graphs (hint, use Seaborn), quantitavely confirm an expected relationship between two columns (or even better, find an unexpected one).</li>
</ul>
</div>
</div>
<div id="outline-container-orgfd5e29b" class="outline-2">
<h2 id="orgfd5e29b"><span class="section-number-2">3</span> Advanced analysis of the dataset</h2>
<div class="outline-text-2" id="text-3">
<p>
Before you try anything fancy, you must first do a basic analysis. Once you are there, there are multiple ways you can go fancy. Pick one, do it thoroughly and only then pick another:
</p>
<ul class="org-ul">
<li>Make your analysis interactive using either:
<ul class="org-ul">
<li>interact <a href="https://ipywidgets.readthedocs.io/en/latest/examples/Using%20Interact.html">https://ipywidgets.readthedocs.io/en/latest/examples/Using%20Interact.html</a></li>
<li>streamlit <a href="https://streamlit.io/">https://streamlit.io/</a></li>
</ul></li>
<li>Try to learn to predict one outcome column from one or more predictor columns (see <a href="https://scikit-learn.org/stable/tutorial/machine_learning_map/index.html">https://scikit-learn.org/stable/tutorial/machine_learning_map/index.html</a>)</li>
<li>Create an unusual visualization that is not just a call to seaborn.</li>
</ul>
</div>
</div>
<div id="outline-container-org218c7d4" class="outline-2">
<h2 id="org218c7d4"><span class="section-number-2">4</span> Presenting to your peers</h2>
<div class="outline-text-2" id="text-4">
<p>
During the second and last hacker's night, you will have two minutes to show your work to your peers.
</p>

<p>
Before the clock hits 19:00, you shall upload your notebook and dataset on my server. To do so, copy paste the following as the second to last cell:
</p>
<div class="org-src-container">
<pre class="src src-python">%%javascript
Ipython.notebook.kernel.execute<span style="color: #4f97d7;">(</span>`notebookName = <span style="color: #2d9574;">'${Ipython.notebook.notebook_name}'</span>`<span style="color: #4f97d7;">)</span>;
</pre>
</div>
<p>
If you get an error running this cell, try the following:
</p>
<div class="org-src-container">
<pre class="src src-python">%%javascript
Jupyter.notebook.kernel.execute<span style="color: #4f97d7;">(</span>`notebookName = <span style="color: #2d9574;">'${Jupyter.notebook.notebook_name}'</span>`<span style="color: #4f97d7;">)</span>;
</pre>
</div>

<p>
And then copy paste the following as the last cell of your notebook:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> requests
<span style="color: #7590db;">filenames</span> = <span style="color: #4f97d7;">[</span>notebookName, <span style="color: #2d9574;">'YOURDATASETNAME.csv'</span><span style="color: #4f97d7;">]</span>  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #cc9393;">FIXME</span>
<span style="color: #7590db;">student_id</span> = <span style="color: #2d9574;">'B00XXXXX'</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #cc9393;">FIXME</span>
<span style="color: #7590db;">first_name</span> = <span style="color: #2d9574;">'John'</span>  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #cc9393;">FIXME</span>
<span style="color: #7590db;">last_name</span> = <span style="color: #2d9574;">'Doe'</span>  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #cc9393;">FIXME</span>
<span style="color: #7590db;">hostname_port</span> = <span style="color: #2d9574;">'http://oneclick.rdklein.fr:5564'</span>
<span style="color: #4f97d7; font-weight: bold;">for</span> f <span style="color: #4f97d7; font-weight: bold;">in</span> filenames:
    <span style="color: #7590db;">r</span> = requests.put<span style="color: #4f97d7;">(</span>f<span style="color: #2d9574;">'{hostname_port}/upload/{student_id}_{first_name}_{last_name}/{f}'</span>,
                     data=<span style="color: #4f97d7;">open</span><span style="color: #bc6ec5;">(</span>f, <span style="color: #2d9574;">'r'</span><span style="color: #bc6ec5;">)</span>.read<span style="color: #bc6ec5;">()</span>.encode<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">'utf-8'</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">assert</span> r.status_code == <span style="color: #a45bad;">200</span>, f<span style="color: #2d9574;">"Server unhappy because of {r.content}"</span>
    <span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>r.content<span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
Edit all the lines that bear a <code>FIXME</code> comment so that they reflect your information, and run the last two cells. This will upload your files, and you will be able to
show them to everybody using my laptop.  
</p>

<p>
Please bear in mind that two minutes times a lot of students is a lot of time. You won't have the whole 12 hours to finish your project. Go straight to the point and go fast.
</p>

<p>
Jupyter Notebooks have a "slide" mode, which can be helpful <a href="https://medium.com/learning-machine-learning/present-your-data-science-projects-with-jupyter-slides-75f20735eb0f">https://medium.com/learning-machine-learning/present-your-data-science-projects-with-jupyter-slides-75f20735eb0f</a>
</p>

<p>
The 2 minutes will be a hard limit. Be very mindful of it and aim for 1m30s instead.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2019-11-26 mar. 17:01</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
